/*
连续子列最大，数组{1,3,-5,-8,9,10,11,-12}，分成连续多段，求每段的和最大，输出这个和。
输入示例：
输出示例：30
*/
#include<stdio.h>
int main() {
	int a[10]= {1,3,-5,-8,9,10,11,-12};
	int b[10]= {0,0,0,0,0,0,0,0};
	int max=b[0];
	for(int s=1; s<10; s++) {
		if(b[s-1] > 0) {                     //如果b的前一项是正数，就加上a
			b[s]=b[s-1]+a[s];
		} else {                             //否则就直接让a=b的这一项 
			b[s] = a[s];
		}
		if(max<b[s]) {                       //更新最大值 
			max=b[s];
		}
	}
	//输出最大 
	printf("%d\n",max);
	//遍历b数组
	/* 
	for(int k=0; k<10; k++) {
		printf("%d\n",b[k]);
	}
	*/
	return 0;
}
